zeranemesis/Marioparty4/partyboard/src/REL/m408Dll/stage.c
s16 fn_1_D978(ANIMDATA *arg0, s16 arg1, HU3DPARTICLEHOOK arg2)
{
    s32 temp_r31;
    HU3DPARTICLEDATA *temp_r30;
    HU3DPARTICLE *temp_r29;
    s32 temp_r28;
    HU3DPARTICLEDATA *temp_r27;
    temp_r28 = Hu3DParticleCreate(arg0, arg1);
    Hu3DParticleHookSet(temp_r28, arg2);
    Hu3DModelAttrSet(temp_r28, HU3D_ATTR_DISPOFF);
    temp_r29 = Hu3DData[temp_r28].hookData;
    temp_r27 = temp_r29->data;
    for (temp_r31 = 0; temp_r31 < temp_r29->maxCnt; temp_r31++, temp_r27++) {
        temp_r27->scale = 0;
    }
    temp_r30 = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(HU3DPARTICLEDATA), MEMORY_DEFAULT_NUM);
    temp_r29->work = temp_r30;
    temp_r30->time = temp_r28;
    temp_r30->parManId = 0;
    for (temp_r31 = 0; temp_r31 < 32; temp_r31++) {
        // Ugly expression to match store without new type
        *((s16 *)(((u8 *)temp_r30) + (temp_r31 * 2) + 4)) = 0;
    }
    return temp_r28;
}

void fn_1_DA6C(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix)
{
    float temp_f31;
    float temp_f30;

    HU3DPARTICLEDATA *temp_r31;
    HU3DPARTICLE *temp_r29;
    s32 temp_r28;
    s32 temp_r27;
    s16 temp_r26;
    temp_r29 = particle->work;
    switch (temp_r29->emitCnt) {
        case 0:
            temp_r31 = particle->data;
            for (temp_r28 = 0; temp_r28 < particle->maxCnt; temp_r28++, temp_r31++) {
                temp_r31->time = 0;
            }
            particle->dataCnt = 0;
            temp_r29->emitCnt++;
            temp_r29->pos.y = 3;
            temp_r29->pos.z = 25;
            break;

        case 1:
            for (temp_r28 = 0; temp_r28 < 100; temp_r28++) {
                temp_r31 = particle->data;
                for (temp_r27 = 0; temp_r27 < particle->maxCnt; temp_r27++, temp_r31++) {
                    if (!temp_r31->time) {
                        break;
                    }
                }
                if (temp_r27 == particle->maxCnt) {
                    temp_r29->emitCnt++;
                    break;
                }
                temp_r31->pos.x = temp_r31->pos.y = temp_r31->pos.z = 0;
                temp_r26 = fn_1_11670() % 360;
                temp_r31->vel.x = sind(temp_r26);
                temp_r31->vel.y = -6.0 + (2.0 * temp_r29->unk_10.x);
                temp_r31->vel.z = cosd(temp_r26);
                temp_r31->accel.x = ((fn_1_11670() & 0x7) + temp_r29->pos.z) - 4.0f;
                temp_r31->accel.x *= 0.1f;
                temp_f31 = temp_r29->pos.y + (0.01 * (float)(fn_1_11670() % 400));
                temp_f31 *= 0.1f;
                temp_r31->pos.x = temp_f31 * temp_r31->vel.x;
                temp_r31->pos.y = 0;
                temp_r31->pos.z = temp_f31 * temp_r31->vel.z;
                temp_r31->scale = (0.01 * (frand() % 2000)) + 30.0;
                temp_r31->scale *= 0.1f;
                temp_r31->color.a = 255;
                temp_r31->time = 30;
            }
            break;
    }
    temp_r31 = particle->data;
    for (temp_r28 = 0; temp_r28 < particle->maxCnt; temp_r28++, temp_r31++) {
        if (temp_r31->time == 0) {
            continue;
        }
        temp_f30 = temp_r31->accel.x;
        temp_r31->pos.x += temp_r31->vel.x * temp_f30;
        temp_r31->pos.y += temp_r31->vel.y;
        temp_r31->pos.z += temp_r31->vel.z * temp_f30;
        temp_r31->scale *= 1.025f;
        temp_r31->color.a *= 0.95f;
        temp_r31->color.a--;
        temp_r31->accel.x *= 0.8f;
        temp_r31->vel.y *= 0.85f;
        temp_r31->vel.y += 0.1f;
        if (temp_r31->color.a < 2) {
            temp_r31->color.a = 0;
            temp_r31->time = 0;
            particle->dataCnt++;
        }
    }
    DCFlushRange(particle->data, particle->maxCnt * sizeof(HU3DPARTICLEDATA));
    if (particle->dataCnt >= particle->maxCnt && temp_r29->emitCnt == 2) {
        temp_r29->emitCnt = 0;
        Hu3DModelAttrReset(temp_r29->dataCnt, HU3D_ATTR_PARTICLE_KILL);
        Hu3DModelKill(temp_r29->dataCnt);
    }
}

void fn_1_DFD0(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix)
{
    float temp_f31;
    HU3DPARTICLEDATA *temp_r31;
    HU3DPARTICLE *temp_r30;
    s32 temp_r28;
    s16 temp_r27;
    s32 temp_r26;
    temp_r30 = particle->work;
    switch (temp_r30->emitCnt) {
        case 0:
            temp_r31 = particle->data;
            temp_r30->pos.x = 10;
            for (temp_r28 = 0; temp_r28 < particle->maxCnt; temp_r28++, temp_r31++) {
                temp_r31->pos.x = temp_r31->pos.y = temp_r31->pos.z = 0;
                temp_r27 = fn_1_11670() % 360;
                temp_r31->vel.x = sind(temp_r27);
                temp_r31->vel.y = 0;
                temp_r31->vel.z = cosd(temp_r27);
                temp_f31 = temp_r30->pos.x + (temp_r30->pos.x * ((1.0 / 65536.0) * (float)fn_1_11670()));
                temp_r31->pos.x = temp_f31 * temp_r31->vel.x;
                temp_r31->pos.y = -(100.0 * ((1.0 / 65536.0) * (float)fn_1_11670()));
                temp_r31->pos.z = temp_f31 * temp_r31->vel.z;
                temp_r31->scale = (0.01 * (frand() % 2000)) + 40.0;
                temp_r26 = frand() & 0x2F;
                temp_r31->color.r = temp_r26 + 208;
                temp_r31->color.g = temp_r26 + 208;
                temp_r31->color.a = (frand() & 0x5F) + 32;
            }
            temp_r30->emitCnt++;
            particle->dataCnt = 60;
            break;

        case 1:
            if (--particle->dataCnt == 0) {
                Hu3DModelAttrReset(temp_r30->dataCnt, HU3D_ATTR_PARTICLE_KILL);
                Hu3DModelKill(temp_r30->dataCnt);
                return;
            }
            break;
    }
    DCFlushRange(particle->data, particle->maxCnt * sizeof(HU3DPARTICLEDATA));
}

void fn_1_E310(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix)
{
    float temp_f31;
    float temp_f30;

    HU3DPARTICLEDATA *temp_r31;
    HU3DPARTICLE *temp_r29;
    s32 temp_r28;
    s32 temp_r27;
    s16 temp_r26;
    temp_r29 = particle->work;
    switch (temp_r29->emitCnt) {
        case 0:
            temp_r31 = particle->data;
            temp_f30 = 360.0f / particle->maxCnt;

